In [15]:
import numpy as np
import pandas as pd
!pip install openpyxl
!pip install lxml
!pip install sqlalchemy

Requirement already satisfied: openpyxl in /opt/conda/lib/python3.9/site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in /opt/conda/lib/python3.9/site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: lxml in /opt/conda/lib/python3.9/site-packages (4.9.1)
Requirement already satisfied: sqlalchemy in /opt/conda/lib/python3.9/site-packages (1.4.29)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.9/site-packages (from sqlalchemy) (1.1.2)

In [2]:
pwd

'/home/jovyan/work/Python_Udemy/3_Pandas'

In [3]:
df =pd.read_csv('example.csv')

In [4]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df.to_csv('my_example.csv')

In [6]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [7]:
df.to_excel('my_excel.xlsx', sheet_name='Sheet1')

In [8]:
df_html = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [9]:
type(df_html)

list

In [11]:
df_html[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [14]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')
df.to_sql('Daten', engine)
sql_df = pd.read_sql('Daten', engine)
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15